In [1]:
import numpy as np 
import pandas as pd

Pivot Tables

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    829     76   John  January      Q1
1  2023-01-02       B   West    321     88   Mary  January      Q1
2  2023-01-03       C  North    700     10    Bob  January      Q1
3  2023-01-04       D  South    798     45  Alice  January      Q1
4  2023-01-05       A   East    913     19   John  January      Q1
5  2023-01-06       B   West    570     24   Mary  January      Q1
6  2023-01-07       C  North    216     14    Bob  January      Q1
7  2023-01-08       D  South    661     39  Alice  January      Q1
8  2023-01-09       A   East    379     79   John  January      Q1
9  2023-01-10       B   West    979     88   Mary  January      Q1
10 2023-01-11       C  North    111     53    Bob  January      Q1
11 2023-01-12       D  South    241     18  Alice  January      Q1
12 2023-01-13       A   East    545     65   John  January      Q1
13 2023-01-14       B   West    724     45   Mary  January      Q1
14 2023-01-15       C  North    311     79    Bob  January      Q1
15 2023-01-16       D  South    849     26  Alice  January      Q1
16 2023-01-17       A   East    326     16   John  January      Q1
17 2023-01-18       B   West    620     44   Mary  January      Q1
18 2023-01-19       C  North    570     49    Bob  January      Q1
19 2023-01-20       D  South    623     44  Alice  January      Q1

In [5]:
pd.pivot_table(df, values='Sales',index='Region',columns='Product',aggfunc='median')

Product      A      B      C      D
Region
East     545.0    NaN    NaN    NaN
North      NaN    NaN  311.0    NaN
South      NaN    NaN    NaN  661.0
West       NaN  620.0    NaN    NaN

In [6]:
pivot2 = pd.pivot_table(df, values=['Sales','Units'],index='Region',columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     598.4    NaN    NaN    NaN  51.0   NaN   NaN   NaN
North      NaN    NaN  381.6    NaN   NaN   NaN  41.0   NaN
South      NaN    NaN    NaN  634.4   NaN   NaN   NaN  34.4
West       NaN  642.8    NaN    NaN   NaN  57.8   NaN   NaN

Cross Tabs

In [7]:
pd.crosstab(df['Region'],df['Product']) #are mainly used to compute frequency tables

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0